<template>
    <div>
        <!-- 헤더영역 -->
        <div class="m-header type02">
            <div class="wrap">
                <div class="left">
                    <img src="/images/arrowLeft-black.png" alt="" style="width:14px;" @click="$router.go(-1)">
                </div>
                <div class="center">
                    <h3 class="title">회원가입</h3>
                </div>
                <div class="right"></div>
            </div>
        </div>

        <div class="area-register-checkPolicy" v-if="step === 1">
            <!-- 내용 영역 -->
            <div class="container">
                <div class="wrap">
                    <div class="mt-40"></div>

                    <div class="m-input-checkbox type01">
                        <input type="checkbox" checked v-if="isAgreeAll">
                        <input type="checkbox" v-else>

                        <label for="" @click="agreeAll">전체동의</label>
                    </div>

                    <div class="mt-16"></div>

                    <div class="m-input-checkbox type01">
                        <input type="checkbox" id="agree1" v-model="agree1">
                        <label for="agree1">
                            (필수) 이용약관 동의
                            <a href="#" class="link">약관보기</a>
                        </label>
                    </div>

                    <div class="mt-4"></div>

                    <div class="m-input-textarea type01">
                        <div class="fake">제 1 조 (목적)
이 이용약관(이하 “본 약관”이라 합니다)은 “"자유마을"”에서 제공하는 인터넷 서비스를 이용함에 있어 회원과 "자유마을"의 권리 의무 및 책임사항 규정함을 목적으로 합니다.

제 2 조 (용어의 정의)
1) "회원"이란 본 이용약관에 동의하고 "자유마을"에 개인정보를 제공하여 회원 등록한자를 말합니다.
2) “비회원”이란 회원에 가입하지 않고 사이트가 제공하는 서비스를 이용하는 자를 말합니다.
3) "자유마을"이란 사이트를 운영하는 주체는 주식회사 자유마을을 말합니다.
4) “사이트”, “서비스”란 회사가 회원들에게 인터넷 관련 서비스를 제공하기 위하여 컴퓨터 정보통신설비를 이용하여 구축한 "자유마을" 앱을 말합니다.
5) 본 약관에서 사용하는 용어 중 정하지 아니한 것은, 관계법령 및 "자유마을"이 정하는 바에 따르며, 그 외에는 일반 관례를 따릅니다.

제 3 조 (약관의 명시와 개정)
1) 본 약관은 사이트 하단 이용약관 링크를 통해 언제든지 확인하실 수 있습니다.
2) "자유마을"은 합리적인 사유가 발생할 경우 관련 법령에 위배되지 않는 범위에서 본 약관을 개정할 수 있습니다.
3) 개정된 약관은 사이트를 통해 공지함으로써 효력을 발휘합니다. 공지는 사이트 첫 화면 공지사항에 적용일자 7일 전부터 적용일자까지 공지합니다.

제 4 조 (회원가입 및 ID부여)
1) 사이트가 제시한 회원가입 절차에 따라, 본 약관에 동의한다는 의사표시를 한 후 가입 양식에 정보를 기입함으로서 회원가입을 신청합니다.
2) 회원가입의 성립 시기는 사이트 회원가입이 완료된 시점으로 합니다.
3) "자유마을"은 회원에 대하여 약관에 정하는 바에 따라 사이트 회원 ID를 부여합니다. 회원 ID는 원칙적으로 변경이 불가하며 부득이한 사유로 인하여 변경 하고자 하는 경우에는 해당 ID를 해지하고 재가입해야 합니다.
4) ID는 본인실명으로 발급하는 것을 원칙으로 합니다.
5) 회원은 등록사항에 변경이 있는 경우, 회원정보수정 페이지를 통하여 변경사항을 정정하여 기재하여야 합니다.
6) "자유마을"은 사이트에 회원 가입을 신청한 회원 중 다음 각 호에 해당하는 회원은 회원등록을 허락하지 않습니다.

① 등록내용에 허위, 기재누락, 오기가 있는 경우
② 사이트의 안녕질서 또는 공서양속을 저해할 목적으로 신청한 경우
③ 실명이 아니거나 타인의 명의를 이용하여 신청한 경우
④ 기타, 사이트가 제공하는 소정의 이용신청요건을 충족하지 못한 경우
⑤ 본 약관 제5조에 의하여 회원자격을 상실한 자로서, 3년이 경과되지 아니한 경우

제 5 조 (회원 정보수정, 탈퇴 및 자격 상실 등)
1)회원 및 이용자는 개인정보관리화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 실명, 아이디 등은 수정이 불가능합니다.
2) 회원 및 이용자는 당사자가 가입신청 시 기재한 사항이 변경되었을 경우, 온라인으로 로그인하여 개인정보를 수정합니다.
3) 제 2항의 변경사항을 변경하지 않아 발생한 불이익에 대하여 단체는 책임지지 않습니다.


회원이 다음 각호의 사유에 해당하는 경우, "자유마을"은 회원자격을 제한 및 정지, 탈퇴시킬 수 있습니다.
① 가입 신청시에 등록내용을 허위로 기록한 사실이 밝혀진 경우
② 다른 회원들의 사이트 이용을 방해하거나, 각 서비스 운영원칙을 따르지 않고 운영질서를 어지럽히는 경우
③ 회원 및 이용자는 당사자가 가입신청 시 기재한 사항이 변경되었을 경우, 온라인으로 로그인하여 개인정보를 수정합니다.
④ 제 2항의 변경사항을 변경하지 않아 발생한 불이익에 대하여 단체는 책임지지 않습니다.
⑤ 법령 위반 또는 외설적인 내용으로 미풍양속에 위배되거나, 공공질서에 저해하는 행위를 하는 경우
⑥ "자유마을"의 합법적인 동의 없이 영리를 추구할 목적으로 사이트를 이용하는 경우
⑦ "자유마을"이 회원 자격을 제한·정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우
⑧ 타인의 ID와 비밀번호를 무단으로 도용한 경우
⑨ 사이트 내에서 컴퓨터 바이러스 프로그램을 유포하는 경우
⑩ "자유마을" 및 회원, 제3자의 지적재산권을 침해하는 경우

제 6 조 (회원의 개인정보보호)

1) "자유마을"은 회원으로 가입하는 시점에서 이름, 생년월일, 성별, 메일, 전화번호, 주소 등을 개인정보로 수집합니다.
2) "자유마을"은 관련법령이 정하는 바에 따라서 회원 등록정보를 포함한 회원의 개인정보를 보호하기 위하여 노력합니다. 단, "자유마을"의 공식 사이트 이외의 링크된 사이트에서는 "자유마을"의 개인정보처리방침이 적용되지 않습니다. 또한 회원은 비밀번호 등이 타인에게 노출되지 않도록 철저히 관리해야 하며 "자유마을"은 회원의 귀책사유로 인해 노출된 정보에 대해서 책임을 지지 않습니다.
3) 회원의 개인정보보호에 관해서는 관련법령 및 "자유마을"이 정하는 “개인정보처리방침”에 정한 바에 의합니다.
4) "자유마을"은 다음과 같은 경우 법이 허용하는 범위 내에서 회원의 개인정보를 제3자에게 제공할 수 있습니다.
① 수사기관이나 기타 정부기관으로부터 정보제공을 요청받은 경우
② 회원의 법령 또는 약관의 위반을 포함하여 부정행위 확인 등의 정보보호 업무를 위해 필요한 경우
③ 기타 법률에 의해 요구되는 경우

제 7 조 (회원에 대한 통지)
1) "자유마을"이 회원에 대한 통지를 하는 경우, 회원이
"자유마을"에 제출한 메일주소, 핸드폰번호(SMS문자)로 할 수 있습니다.
2) "자유마을"은 불특정다수 회원에 대한 통지의 경우 1주일이상 사이트 해당 게시판에 게시함으로서 개별 통지에 갈음할 수 있습니다.

제 8 조 (서비스의 내용)
"자유마을"은 사이트를 통해 다음과 같은 서비스를 제공합니다.

1) 뉴스 서비스
2) 미디어 서비스
3) 쇼핑 서비스 (쇼핑 중개 서비스)
4) 행사 서비스 (행사 중개 서비스)
5) 교육 서비스
6) 기타 "자유마을"이 추후에 다른 단체와 제휴하여 제공하는 일체의 서비스

제 9 조 (서비스 이용계약의 성립)
"자유마을"이 사이트에 제시한 회원가입 절차에 따라, 본 약관에 동의하고, 회원정보 입력 후 가입하기 버튼을 누르면,
"자유마을" 서비스 및 기타 사이트에서 제공하는 모든 서비스 이용에 동의하는 것으로 인정합니다.

제 10 조 (서비스 이용시간)
1) "자유마을"의 업무상 혹은 기술상 특별한 이유가 없는 한 "자유마을"에서 제공하는 서비스는 365일, 1일 24시간 지속적으로 이용할 수 있습니다.
2) "자유마을"은 시스템 정기점검, 증설 및 교체를 위해 "자유마을"이 정한 날이나 시간에 서비스를 일시 중단할 수 있으며, 예정되어 있는 작업으로 인한 서비스 일시 중단은 사이트를 통해 사전에 공지합니다.
3) "자유마을"은 긴급한 시스템 점검, 증설 및 교체, 설비의 장애,, 서비스 이용의 폭주, 국가비상사태, 정전 등 부득이한 사유가 발생한 경우 사전 예고 없이 일시적으로 서비스의 전부 또는 일부를 중단할 수 있습니다.

제 11 조 (서비스 이용 제한)
"자유마을"은 회원이 서비스 이용내용에 있어서 본 약관 제 5조를 위반하거나, 다음 각 호에 해당하는 경우 서비스 이용, 제한 , 초기화, 이용계약 해지 및 기타 해당 조치를 할 수 있습니다.

① 공공질서 및 미풍양속에 위반되는 저속, 음란한 내용 또는 타인의 명예나 프라이버시를 침해할 수 있는 내용의 정보, 문장, 도형, 음향, 동영상을 전송, 게시, 메일 또는 기타의 방법으로 타인에게 유포하는 행위
② 다른 이용자를 희롱 또는 위협하거나, 특정 이용자에게 지속적으로 고통 또는 불편을 주는 행위
③ 정보통신윤리위원회등 관련 공공기관의 시정 요구가 있는 경우
④ 3개월 이상 사이트에 로그인 한 적이 없는 경우
⑤ 약관을 포함하여 회사가 정한 제반 규정을 위반하거나 범죄와 결부된다고 객관적으로 판단되는 등 제반 법령을 위반하는 행위

제 12 조 (서비스의 중단)
1) "자유마을"은 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
2) 새로운 서비스로의 교체등 기타 "자유마을"이 적절하다고 판단하는 합리적인 사유의 경우 현재 제공되는 서비스를 완전히 중단할 수 있습니다.
3) 서비스 중단의 경우에 "자유마을"은 제7조에 정한 방법으로 회원에게 사전 통지합니다. 단, "자유마을"이 통제할 수 없는 사유로 인한 서비스의 중단(시스템 관리자의 고의, 과실이 없는 디스크 장애, 시스템다운 등)으로 인하여 사전 통지가 불가능한 경우에는 그러하지 아니합니다.


제 13 조 (서비스의 쇼핑 중개 및 약관 적용)
1) "자유마을"은 사이트에서 제공되거나 연결된 서비스 및 상품 직접 링크를 통해서 사이버쇼핑몰로 쇼핑을 중개할 수 있습니다.
2) 쇼핑 링크 이용약관은 페이지 하단을 통해 공지하며 공정거래위원회 표준약관을 사용합니다.
3) 쇼핑 링크 중 “광화문 온” 외의 쇼핑몰로 이동하는 경우의 이용약관은 해당 쇼핑몰의 이용약관을 사용합니다.

제 14 조 ("자유마을"의 의무)
1) "자유마을"은 법령과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하는 데 최선을 다하여야 합니다.
2) "자유마을"은 계속적이고 안정적인 서비스의 제공을 위하여 설비에 장애가 생기거나 멸실된 때에는 부득이한 사유가 없는 한 지체 없이 이를 수리 또는 복구합니다.
3) "자유마을"은 회원이 안전하게 사이트를 이용할 수 있도록 회원의 개인정보(신용정보 포함)보호를 위한 보안 시스템을 구축합니다.

제 15 조 (회원의 의무)
1) 회원은 회원가입 신청 또는 회원정보 변경시 모든 사항을 사실에 근거하여 본인의 진정한 정보로 작성하여야 하며, 허위 또는 타인의 정보를 등록할 경우 이와 관련된 모든 권리를 주장할 수 없습니다.
2) 회원은 약관에서 규정하는 사항과 기타 "자유마을"이 정한 제반 규정, 공지사항등 "자유마을"이 공지하는 사항 및 관계 법령을 준수하여야 하며, 기타 "자유마을"의 업무에 방해가 되는 행위, "자유마을"의 명예를 손상시키는 행위, 타인에게 피해를 주는 행위를 해서는 안 됩니다.
3) 회원은 주소, 연락처, 전자우편 주소 등 이용계약 사항이 변경된 경우에 회원정보수정을 거쳐 변경된 내용을 알려야 합니다.
4) 회원은 "자유마을"의 사전 승낙 없이 서비스를 이용하여 영업활동을 할 수 없으며, 그 영업 활동의 결과에 대해 "자유마을"은 책임을 지지 않습니다. 또한 회원은 이와 같은 영업 활동으로 "자유마을"이 손해를 입은 경우, 회원은 "자유마을"에 대해 손해배상의무를 지며, "자유마을"은 해당 회원에 대해 서비스 이용제한 및 적법한 절차를 거쳐 손해배상 등을 청구 할 수 있습니다.
5) 회원은 "자유마을"의 명시적 동의가 없는 한 서비스의 이용권한, 기타 이용계약상의 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다.
6) 회원은 "자유마을" 및 제 3자의 지적 재산권을 포함한 제반 권리를 침해하거나 제 5조 각 호에 해당하는 행위를 해서는 안 됩니다.


제 16 조 (광고게재 및 광고주와의 거래)
1) "자유마을"이 회원에게 서비스를 제공할 수 있는 서비스 투자기반의 일부는 광고게재를 통한 수익으로부터 나옵니다. 회원은 서비스 이용시 노출되는 광고게재에 대해 동의합니다.
2) "자유마을"은 서비스 상에 게재되어 있거나 서비스를 통한 광고주의 판촉활동에 회원이 참여하거나 교신 또는 거래를 함으로써 발생하는 손실과 손해에 대해 책임을 지지 않습니다.

제 17 조 (게시물)
1) 게시물이라 함은 회원이 서비스를 이용하면서 게시판 글, 댓글, 사진, 동영상, 각종 파일과 링크 등을 말합니다.
2) 회원이 서비스에 등록하는 게시물 등으로 인하여 본인 또는 타인에게 손해나 기타 문제가 발생하는 경우 회원은 이에 대한 책임을 지게 되며, "자유마을"은 이에 대하여 책임을 지지 않습니다.
3) "자유마을"은 다음 각 호에 해당하는 게시물 등을 회원의 사전 동의 없이 임시게시 중단, 수정, 삭제, 이동 또는 등록거부 등의 관련 조치를 취할 수 있습니다.
① 타인에 대한 인신공격성 발언, 저속한 표현 등을 사용한 경우
② 이단시비와 관련된 내용을 유포, 링크하는 것으로 인해 "자유마을" 인터넷 서비스의 본연의 목적과 취지에 위배되는 경우
③ 외설적인 내용으로 미풍양속에 위배되거나, 공공질서에 저해하는 내용을 유포, 링크하는 경우
④ 영리를 목적으로 하는 광고일 경우
⑤ 범죄와 결부된다고 객관적으로 인정되는 내용일 경우
⑥ "자유마을"을 포함한 다른 회원 또는 제 3자의 저작권 등 기타 권리를 침해하는 내용인 경우
⑦ "자유마을"에서 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우
⑧ 기타 관계법령에 위반되는 경우

제 18 조 (저작권의 귀속 및 이용제한)
1) "자유마을"이 작성한 저작물에 대한 저작권 및 기타 지적재산권은 "자유마을"에 귀속합니다.
회원은 사이트를 이용함으로써 얻은 정보를 "자유마을"의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안 됩니다.
2) 게시물(회원이 사이트에 등록한 글, 댓글, 사진, 동영상, 각종 파일 등)에 대한 권리와 책임은 회원에게 있습니다. "자유마을"은 회원의 동의 없이 게시물을 영리적 목적으로 사용하지 않습니다.

제 19 조 (분쟁해결)
1) "자유마을"은 회원이 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 적극적으로 처리합니다.
2) "자유마을"은 회원으로부터 제출되는 불만사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 회원에게 그 사유와 처리일정을 즉시 통보합니다.


제 20 조(면책조항)
1) 천재지변 등 불가항력에 의한 서비스 중단 및 회원이 올린 데이타의 유실 혹은 손상시 "자유마을"은 책임이 면제됩니다.
2) "자유마을"은 회원이 게재한 정보의 사실여부, 정확도 등 내용에 대해서는 책임이 면제됩니다.
3) 서비스 이용과 관련하여 회원에게 발생한 손해 중 회원의 고의, 과실에 의한 손해에 대하여 책임이 면제 됩니다.
4) "자유마을"은 회원이 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지 않으며 그밖에 서비스를 통하여 얻은 자료로 인한 손해에 관하여 책임이 면제됩니다.

제 21 조(재판권 및 준거법)
1) "자유마을"과 회원간에 발생한 전자거래 분쟁에 관한 소송은 "자유마을"운영사 소재지 관할법원에 제기합니다.
2) "자유마을"과 회원간에 제기된 전자거래 소송에는 한국법을 적용합니다.

제21조(연결“몰”과 피 연결“몰” 간의 관계)
1) 상위 “몰”과 하위 “몰”이 하이퍼링크(예: 하이퍼링크의 대상에는 문자, 그림 및 동화상 등이 포함됨)방식 등으로 연결된 경우, 전자를 연결 “몰”(웹 사이트)이라고 하고 후자를 피 연결 “몰”(웹 사이트)이라고 합니다.

2) 연결“몰”은 피 연결“몰”이 독자적으로 제공하는 재화 등에 의하여 이용자와 행하는 거래에 대해서 보증 책임을 지지 않는다는 뜻을 연결“몰”의 초기화면 또는 연결되는 시점의 팝업화면으로 명시한 경우에는 그 거래에 대한 보증 책임을 지지 않습니다.

제22조(저작권의 귀속 및 이용제한)
1) “몰“이 작성한 저작물에 대한 저작권 기타 지적재산권은 ”몰“에 귀속합니다.

2) 이용자는 “몰”을 이용함으로써 얻은 정보 중 “몰”에게 지적재산권이 귀속된 정보를 “몰”의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안 됩니다.

3) “몰”은 약정에 따라 이용자에게 귀속된 저작권을 사용하는 경우 당해 이용자에게 통보하여야 합니다.

- 부칙 -
본 이용약관이 법령, 정책 또는 "자유마을"의 합리적인 이유에 의해 내용의 추가, 삭제 및 수정이 있을 시에는 변경사항의 시행일의 7일 전부터 "자유마을" 사이트의 공지사항을 통하여 고지할 것 입니다.


1. 본 약관은 2021년 6월 23일부터 적용됩니다.
                        </div>
                    </div>

                    <div class="mt-16"></div>

                    <div class="m-input-checkbox type01">
                        <input type="checkbox" id="agree2" v-model="agree2">
                        <label for="agree2">
                            (필수) 개인정보처리방침 동의
                            <a href="#" class="link">약관보기</a>
                        </label>
                    </div>

                    <div class="mt-4"></div>

                    <div class="m-input-textarea type01">
                        <div class="fake">제 22조(동의를 받는 방법)
① 자유마을은 이 법에 따른 개인정보의 처리에 대하여 정보주체(제6항에 따른 법정대리인을 포함한다. 이하 이 조에서 같다)의 동의를 받을 때에는 각각의 동의 사항을 구분하여 정보주체가 이를 명확하게 인지할 수 있도록 알리고 각각 동의를 받아야 한다.
② 자유마을은 제1항의 동의를 서면(「전자문서 및 전자거래 기본법」 제2조제1호에 따른 전자문서를 포함한다)으로 받을 때에는 개인정보의 수집ㆍ이용 목적, 수집ㆍ이용하려는 개인정보의 항목 등 대통령령으로 정하는 중요한 내용을 보호위원회가 고시로 정하는 방법에 따라 명확히 표시하여 알아보기 쉽게 하여야 한다.
③ 자유마을은 제15조제1항제1호, 제17조제1항제1호, 제23조제1항제1호 및 제24조제1항제1호에 따라 개인정보의 처리에 대하여 정보주체의 동의를 받을 때에는 정보주체와의 계약 체결 등을 위하여 정보주체의 동의 없이 처리할 수 있는 개인정보와 정보주체의 동의가 필요한 개인정보를 구분하여야 한다. 이 경우 동의 없이 처리할 수 있는 개인정보라는 입증책임은 자유마을가 부담한다.
④ 자유마을은 정보주체에게 재화나 서비스를 홍보하거나 판매를 권유하기 위하여 개인정보의 처리에 대한 동의를 받으려는 때에는 정보주체가 이를 명확하게 인지할 수 있도록 알리고 동의를 받아야 한다.
⑤ 자유마을은 정보주체가 제3항에 따라 선택적으로 동의할 수 있는 사항을 동의하지 아니하거나 제4항 및 제18조제2항제1호에 따른 동의를 하지 아니한다는 이유로 정보주체에게 재화 또는 서비스의 제공을 거부하여서는 아니 된다.
⑥ 자유마을은 만 14세 미만 아동의 개인정보를 처리하기 위하여 이 법에 따른 동의를 받아야 할 때에는 그 법정대리인의 동의를 받아야 한다. 이 경우 법정대리인의 동의를 받기 위하여 필요한 최소한의 정보는 법정대리인의 동의 없이 해당 아동으로부터 직접 수집할 수 있다.
⑦ 제1항부터 제6항까지에서 규정한 사항 외에 정보주체의 동의를 받는 세부적인 방법 및 제6항에 따른 최소한의 정보의 내용에 관하여 필요한 사항은 개인정보의 수집매체 등을 고려하여 대통령령으로 정한다.

제39조의3(개인정보의 수집ㆍ이용 동의 등에 대한 특례)
① 자유마을은 제15조제1항에도 불구하고 이용자의 개인정보를 이용하려고 수집하는 경우에는 다음 각 호의 모든 사항을 이용자에게 알리고 동의를 받아야 한다. 다음 각 호의 어느 하나의 사항을 변경하려는 경우에도 또한 같다.
1. 개인정보의 수집ㆍ이용 목적
2. 수집하는 개인정보의 항목
3. 개인정보의 보유ㆍ이용 기간
② 자유마을은 다음 각 호의 어느 하나에 해당하는 경우에는 제1항에 따른 동의 없이 이용자의 개인정보를 수집ㆍ이용할 수 있다.
1. 자유마을(「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제2조제1항제2호에 따른 자유마을를 말한다. 이하 같다)의 제공에 관한 계약을 이행하기 위하여 필요한 개인정보로서 경제적ㆍ기술적인 사유로 통상적인 동의를 받는 것이 뚜렷하게 곤란한 경우
2. 자유마을의 제공에 따른 요금정산을 위하여 필요한 경우
3. 다른 법률에 특별한 규정이 있는 경우
③ 자유마을 제공자는 이용자가 필요한 최소한의 개인정보 이외의 개인정보를 제공하지 아니한다는 이유로 그 서비스의 제공을 거부해서는 아니 된다. 이 경우 필요한 최소한의 개인정보는 해당 서비스의 본질적 기능을 수행하기 위하여 반드시 필요한 정보를 말한다.
④ 자유마을 제공자는 만 14세 미만의 아동으로부터 개인정보 수집ㆍ이용ㆍ제공 등의 동의를 받으려면 그 법정대리인의 동의를 받아야 하고, 대통령령으로 정하는 바에 따라 법정대리인이 동의하였는지를 확인하여야 한다.
⑤ 자유마을 제공자는 만 14세 미만의 아동에게 개인정보 처리와 관련한 사항의 고지 등을 하는 때에는 이해하기 쉬운 양식과 명확하고 알기 쉬운 언어를 사용하여야 한다.
⑥ 보호위원회는 개인정보 처리에 따른 위험성 및 결과, 이용자의 권리 등을 명확하게 인지하지 못할 수 있는 만 14세 미만의 아동의 개인정보 보호 시책을 마련하여야 한다.

제23조(민감정보의 처리 제한)
①자유마을은 불법 정보, 그 밖에 정보주체의 사생활을 현저히 침해할 우려가 있는 개인정보는 처리하여서는 아니 된다. 다만, 다음 각 호의 어느 하나에 해당하는 경우에는 그러하지 아니하다.
1. 정보주체에게 제15조제2항 각 호 또는 제17조제2항 각 호의 사항을 알리고 다른 개인정보의 처리에 대한 동의와 별도로 동의를 받은 경우
2. 법령에서 민감정보의 처리를 요구하거나 허용하는 경우
② 자유마을가 제1항 각 호에 따라 민감정보를 처리하는 경우에는 그 민감정보가 분실ㆍ도난ㆍ유출ㆍ위조ㆍ변조 또는 훼손되지 아니하도록 제29조에 따른 안전성 확보에 필요한 조치를 하여야 한다.


개인정보 이용 및 제공

제 30조(개인정보 처리방침의 수립 및 공개)
① 자유마을은 다음 각 호의 사항이 포함된 개인정보의 처리 방침(이하 “개인정보 처리방침”이라 한다)을 정하여야 한다. 이 경우 공공기관은 제32조에 따라 등록대상이 되는 개인정보파일에 대하여 개인정보 처리방침을 정한다. <개정 2016. 3. 29., 2020. 2. 4.>
1. 개인정보의 처리 목적
2. 개인정보의 처리 및 보유 기간
3. 개인정보의 제3자 제공에 관한 사항(해당되는 경우에만 정한다)
3의2. 개인정보의 파기절차 및 파기방법(제21조제1항 단서에 따라 개인정보를 보존하여야 하는 경우에는 그 보존근거와 보존하는 개인정보 항목을 포함한다)
4. 개인정보처리의 위탁에 관한 사항(해당되는 경우에만 정한다)
5. 정보주체와 법정대리인의 권리ㆍ의무 및 그 행사방법에 관한 사항
6. 제31조에 따른 개인정보 보호책임자의 성명 또는 개인정보 보호업무 및 관련 고충사항을 처리하는 부서의 명칭과 전화번호 등 연락처
7. 인터넷 접속정보파일 등 개인정보를 자동으로 수집하는 장치의 설치ㆍ운영 및 그 거부에 관한 사항(해당하는 경우에만 정한다)
8. 그 밖에 개인정보의 처리에 관하여 대통령령으로 정한 사항
② 자유마을가 개인정보 처리방침을 수립하거나 변경하는 경우에는 정보주체가 쉽게 확인할 수 있도록 대통령령으로 정하는 방법에 따라 공개하여야 한다.
③ 개인정보 처리방침의 내용과 자유마을와 정보주체 간에 체결한 계약의 내용이 다른 경우에는 정보주체에게 유리한 것을 적용한다.
④ 보호위원회는 개인정보 처리방침의 작성지침을 정하여 자유마을에게 그 준수를 권장할 수 있다. <개정 2013. 3. 23., 2014. 11. 19., 2017. 7. 26., 2020. 2. 4.>
개인정보 보호조치

제39조의 5(개인정보의 보호조치에 대한 특례)
정보통신서비스 제공자등은 이용자의 개인정보를 처리하는 자를 최소한으로 제한하여야 한다.

제 29조(안전조치의무)
자유마을는 개인정보가 분실ㆍ도난ㆍ유출ㆍ위조ㆍ변조 또는 훼손되지 아니하도록 내부 관리계획 수립, 접속기록 보관 등 대통령령으로 정하는 바에 따라 안전성 확보에 필요한 기술적ㆍ관리적 및 물리적 조치를 하여야 한다.


이용자 관리

제39조의 3(개인정보의 수집이용 동의 등에 대한 특례)
① 자유마을은 제15조제1항에도 불구하고 이용자의 개인정보를 이용하려고 수집하는 경우에는 다음 각 호의 모든 사항을 이용자에게 알리고 동의를 받아야 한다. 다음 각 호의 어느 하나의 사항을 변경하려는 경우에도 또한 같다.
1. 개인정보의 수집ㆍ이용 목적
2. 수집하는 개인정보의 항목
3. 개인정보의 보유ㆍ이용 기간
② 정보통신서비스 제공자는 다음 각 호의 어느 하나에 해당하는 경우에는 제1항에 따른 동의 없이 이용자의 개인정보를 수집ㆍ이용할 수 있다.
1. 정보통신서비스(「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제2조제1항제2호에 따른 정보통신서비스를 말한다. 이하 같다)의 제공에 관한 계약을 이행하기 위하여 필요한 개인정보로서 경제적ㆍ기술적인 사유로 통상적인 동의를 받는 것이 뚜렷하게 곤란한 경우
2. 정보통신서비스의 제공에 따른 요금정산을 위하여 필요한 경우
3. 다른 법률에 특별한 규정이 있는 경우
③ 정보통신서비스 제공자는 이용자가 필요한 최소한의 개인정보 이외의 개인정보를 제공하지 아니한다는 이유로 그 서비스의 제공을 거부해서는 아니 된다. 이 경우 필요한 최소한의 개인정보는 해당 서비스의 본질적 기능을 수행하기 위하여 반드시 필요한 정보를 말한다.
④ 정보통신서비스 제공자는 만 14세 미만의 아동으로부터 개인정보 수집ㆍ이용ㆍ제공 등의 동의를 받으려면 그 법정대리인의 동의를 받아야 하고, 대통령령으로 정하는 바에 따라 법정대리인이 동의하였는지를 확인하여야 한다.
⑤ 정보통신서비스 제공자는 만 14세 미만의 아동에게 개인정보 처리와 관련한 사항의 고지 등을 하는 때에는 이해하기 쉬운 양식과 명확하고 알기 쉬운 언어를 사용하여야 한다.
⑥ 보호위원회는 개인정보 처리에 따른 위험성 및 결과, 이용자의 권리 등을 명확하게 인지하지 못할 수 있는 만 14세 미만의 아동의 개인정보 보호 시책을 마련하여야 한다.

제22조의 (동의를 받는 방법)
① 자유마을는 이 법에 따른 개인정보의 처리에 대하여 정보주체(제6항에 따른 법정대리인을 포함한다. 이하 이 조에서 같다)의 동의를 받을 때에는 각각의 동의 사항을 구분하여 정보주체가 이를 명확하게 인지할 수 있도록 알리고 각각 동의를 받아야 한다.
② 자유마을는 제1항의 동의를 서면(「전자문서 및 전자거래 기본법」 제2조제1호에 따른 전자문서를 포함한다)으로 받을 때에는 개인정보의 수집ㆍ이용 목적, 수집ㆍ이용하려는 개인정보의 항목 등 대통령령으로 정하는 중요한 내용을 보호위원회가 고시로 정하는 방법에 따라 명확히 표시하여 알아보기 쉽게 하여야 한다. <신설 2017. 4. 18., 2017. 7. 26., 2020. 2. 4.>
③ 자유마을는 제15조제1항제1호, 제17조제1항제1호, 제23조제1항제1호 및 제24조제1항제1호에 따라 개인정보의 처리에 대하여 정보주체의 동의를 받을 때에는 정보주체와의 계약 체결 등을 위하여 정보주체의 동의 없이 처리할 수 있는 개인정보와 정보주체의 동의가 필요한 개인정보를 구분하여야 한다. 이 경우 동의 없이 처리할 수 있는 개인정보라는 입증책임은 자유마을가 부담한다. <개정 2016. 3. 29., 2017. 4. 18.>
④ 자유마을는 정보주체에게 재화나 서비스를 홍보하거나 판매를 권유하기 위하여 개인정보의 처리에 대한 동의를 받으려는 때에는 정보주체가 이를 명확하게 인지할 수 있도록 알리고 동의를 받아야 한다. <개정 2017. 4. 18.>
⑤ 자유마을는 정보주체가 제3항에 따라 선택적으로 동의할 수 있는 사항을 동의하지 아니하거나 제4항 및 제18조제2항제1호에 따른 동의를 하지 아니한다는 이유로 정보주체에게 재화 또는 서비스의 제공을 거부하여서는 아니 된다. <개정 2017. 4. 18.>
⑥ 자유마을는 만 14세 미만 아동의 개인정보를 처리하기 위하여 이 법에 따른 동의를 받아야 할 때에는 그 법정대리인의 동의를 받아야 한다. 이 경우 법정대리인의 동의를 받기 위하여 필요한 최소한의 정보는 법정대리인의 동의 없이 해당 아동으로부터 직접 수집할 수 있다. <개정 2017. 4. 18.>
⑦ 제1항부터 제6항까지에서 규정한 사항 외에 정보주체의 동의를 받는 세부적인 방법 및 제6항에 따른 최소한의 정보의 내용에 관하여 필요한 사항은 개인정보의 수집매체 등을 고려하여 대통령령으로 정한다. <개정 2017. 4. 18.>
                        </div>
                    </div>

                    <div class="mt-16"></div>

                    <div class="m-input-checkbox type01">
                        <input type="checkbox" id="agree3" v-model="agree3">
                        <label for="agree3">(필수) 만 14세 이상입니다.</label>
                    </div>

                    <div class="mt-16"></div>

                    <div class="m-input-checkbox type01">
                        <input type="checkbox" id="is_agree_push" v-model="form.is_agree_push">
                        <label for="is_agree_push">(선택) 푸시(알람서비스) 수신 동의</label>
                    </div>

                    <div class="mt-16"></div>

                    <div class="comment">
                        회원가입이 어려우신 경우
                        <br/><a href="tel:15447166" class="point">콜센터 ☎1544-7166</a>로 문의해주세요.
                    </div>
                    <div class="mt-24"></div>

                    <button class="m-btn type02 width-100" @click="next">정보입력</button>
                </div>
            </div>
        </div>

        <div class="area-register" v-if="step === 2" @keydown="() => errors = ''">
            <!-- 내용 영역 -->
            <div class="container">
                <div class="wrap">
                    <div class="mt-40"></div>

                    <div class="m-input-wrap">
                        <h3 class="m-input-title type01">이름</h3>

                        <div class="m-input-text type01">
                            <input type="text" placeholder="이름 입력" v-model="form.nickname">
                        </div>

                        <p class="m-input-error" v-if="errors.nickname" v-text="errors.nickname[0]"></p>
                    </div>

                    <div class="mt-16"></div>

                    <div class="m-input-wrap">
                        <h3 class="m-input-title type01">생년월일</h3>

                        <div class="m-input-text type01">
                            <input type="text" placeholder="6자리 숫자 입력 (660510)" v-model="form.birth">
                        </div>

                        <p class="m-input-error" v-if="errors.birth" v-text="errors.birth[0]"></p>
                    </div>

                    <div class="mt-16"></div>

                    <div class="m-input-wrap">
                        <h3 class="m-input-title type01">내 지역 선택</h3>

                        <!-- <input-region @change="(data) => {form.district_id = data.district_id}"/> -->
                        <input-region
                            :districtContainer="container"
                            :initiationCalled="activeFinder"
                            @change="changeDistrict"
                        />

                        <p class="m-input-error" v-if="errors.district_id" v-text="errors.district_id[0]"></p>

                      <!-- <div class="mt-8">
                            <span style="color: red">*</span>행정동을 모르실 경우 찾기 버튼을 누르세요.  <button style="color: #0f38bd;" v-touch:tap="active">찾기</button>
                        </div> -->
                    </div>

                    <div class="mt-16"></div>

                    <div class="m-input-wrap">
                        <h3 class="m-input-title type01">연락처</h3>

                        <div class="m-input-text type01">
                            <input type="text" placeholder="번호 입력(01077775555)" v-model="form.phone">
                        </div>

                        <p class="m-input-error" v-if="errors.phone" v-text="errors.phone[0]"></p>

                    </div>

                    <div class="mt-16"></div>

                    <div class="m-input-wrap">
                        <h3 class="m-input-title type01">성별</h3>

                        <div class="m-input-checkboxes type01">
                            <div class="m-input-checkbox">
                                <input type="radio" id="남" value="남" v-model="form.gender">
                                <label for="남">남</label>
                            </div>
                            <div class="m-input-checkbox">
                                <input type="radio" id="여" value="여" v-model="form.gender">
                                <label for="여">여</label>
                            </div>
                        </div>

                        <p class="m-input-error" v-if="errors.gender" v-text="errors.gender[0]"></p>

                    </div>

                    <div class="mt-16"></div>

                    <div class="m-input-wrap">
                        <h3 class="m-input-title type01">추천인 이름 / 연락처 등록</h3>

                        <div class="m-input-text type01">
                            <input type="text" placeholder="홍길동 / 01077775555" v-model="form.referrer">
                        </div>

                        <p class="m-input-error" v-if="errors.referrer" v-text="errors.referrer[0]"></p>

                    </div>

                    <div class="mt-16"></div>

                    <div class="m-input-checkbox type01">
                        <input type="checkbox" id="agree" v-model="form.is_agree_privacy">
                        <label for="agree">개인정보 수집 및 이용에 동의함</label>
                    </div>

                    <div class="mt-24"></div>

                    <div class="m-btns type01">
                        <div class="m-btn-wrap">
                            <button type="submit" class="m-btn type02 width-100" @click="helpRegister">가입 도와주기</button>
                        </div>
                        <div class="m-btn-wrap">
                            <button type="submit" class="m-btn type02 width-100" @click="register">직접 가입하기</button>
                        </div>
                    </div>

                </div>
            </div>
        </div>

        <Finder
            v-if="activeFinder"
            :title="'주소로 행정동 찾기'"
            :excecute="'변환하기'"
            :cancel="'검색하기'"
            @cancel="closeFinder"
            @setContainer="setContainer"
        />
    </div>

</template>

<script>
import InputRegion from "~/components/inputRegion";

export default {
    components: {InputRegion},
    auth: 'guest',
    data() {
        return {
            activeFinder:false,
            container:{},
            step: 1,
            form: {
                nickname: "",
                birth: "",
                phone: "",
                gender: "남",
                referrer: "",
                district_id: "",
                is_agree_privacy: false,
                is_agree_push: false,
            },
            agree1: false,
            agree2: false,
            agree3: false,
            errors: {},
        }
    },
    methods: {
        active() {
            this.activeFinder = true;
        },
        closeFinder() {
            this.activeFinder = false;
        },
        setContainer(container) {
            this.container = container;
        },
        changeDistrict(data) {
            this.form.district = data.district
        },
        register() {
            if(!this.form.is_agree_privacy)
                return alert("필수약관에 동의해주세요.");

                    /*return this.$axios.post("/auth/check-nickname", this.form).then((response) => {
                console.log(response);
                });
                */
                this.$axios.post("/auth/register", this.form)
                .then((response) => {
                    this.login({
                        phone: this.form.phone,
                        password: this.form.birth,
                    }, () => {
                        this.$router.push("/auth/success");

                        this.$store.commit("changeDistrict",this.$auth.user.district);
                    });
                })
                .catch((error) => {
                    if (error.response && error.response.data)
                        this.errors = error.response.data.errors;
                });


        },
        helpRegister() {
            if(!this.form.is_agree_privacy)
                return alert("필수약관에 동의해주세요.");

            this.$axios.post("/auth/register", this.form)
                .then((response) => {
                    alert('가입신천이 완료되었습니다.')
                    this.$router.push("/");
                })
                .catch(e => {
                    if(e.response && e.response.data)
                        this.errors = e.response.data.errors;
                });
        },

        agreeAll() {
            this.agree1 = true;
            this.agree2 = true;
            this.agree3 = true;
            this.form.is_agree_push = true;
        },

        next() {
            if (this.step === 1) {
                if (!this.agree1 || !this.agree2 || !this.agree3)
                    return alert("필수약관에 동의해주세요.");
            }

            this.step += 1;
        },

        login(data, callback) {
            this.$auth.loginWith('laravelSanctum', {data: data})
                .then((response) => {
                    callback();
                })
                .catch(e => {

                });
        },

    },

    computed: {
        isAgreeAll() {
            return this.agree1 && this.agree2 && this.agree3 && this.form.is_agree_push;
        }
    },

    mounted() {

    }
}
</script>

<style scoped>
    .fake {
        color: #999;
    }
</style>
